{
  "上海宇泽逢源化工有限公司": "Shanghai AgroWonderful Industrial Co., Ltd",
  "邮箱": "E-mail",
  "杀虫剂": "Insecticides",
  "除草剂": "herbicides",
  "杀菌剂": "fungicides",
  "植物生长调节剂": "plant growth regulators",
  "原药": "TC",
  "首页": "Home",
  "网站首页": "Home",
  "关于我们": "About us",
  "公司简介": "Company introduction",
  "公司简介介绍": "Shanghai AgroWonderful Industrial Co., Ltd<br />Main Products: Insecticides, herbicides, fungicides, plant growth regulators<br />Annual Production capacity: 2500 metric tons<br />Enterprise Nature: Integration of industry and trade<br />Production lines: 2 technical production lines, 5 formulation production lines<br />Qualification: ISO9001 quality management system certification<br />Services: ICAMA, GLP 5 batch registration, OEM<br />Established: 1993; 1995<br />Registered Capital: 6 million US dollars<br />Factory Address: Hubei Province, China; Jiangsu Province, China, 2 hours drive from Shanghai Port<br />Area: 35 hectares<br />Number of employees: 300<br />Market: Eastern Europe, Central Asia, Southeast Asia, Africa<br /><br />Shanghai AgroWonderful Industrial Co., Ltd is a group company mainly engaged in insecticides, herbicides, fungicides, and plant growth regulators. The group owns 1 technical products factory and 1 formulation factory. The TC factory was established in 1993, located in Hubei Province, China, covering an area of 15 hectares, with 2 TC production lines, mainly producing and exporting abamectin TC, emamectin benzoate TC, glyphosate TC, etc. , with an annual production capacity of 1,000 metric tons. 1 formulation factory was established in 1995, located in Jiangsu Province, China, covering an area of 20 hectares, with 5 formulation production lines, mainly producing SL, EC, SC, FS, WP, WDG, SP, CS and other formulations, with an annual production capacity of 1500 metric tons. The 2 factories have passed the ISO9001 quality management system certification. We are committed to providing high-quality pesticides for the Chinese and global markets, supporting OEM, as well as ICAMA and registration services. Currently, we have successfully registered more than 180 in more than 20 countries around the world.",
  "企业文化": "Our Culture",
  "企业文化介绍": "In 30 years of operation, we are convinced that:<br />Quality is our life, service is our soul!<br />Customer demand is our demand!",
  "社会责任": "Our Social Responsibility",
  "社会责任介绍": "We are committed to becoming a bridge between China and the world, allowing more countries and people to use high-quality and low-cost pesticides to contribute to plant protection and environmental protection.Under this premise, we are committed to customers provide high-quality and low-cost products and warm services. We also firmly believe in and respect our employees, and actively encourage them to take more social responsibilities and be responsible to customers.",
  "全球市场": "Global Market",
  "全球市场介绍": "Our product line is rich and targeted, which can meet the different needs of different markets, so the product market is all over the world:<br />Eastern Europe, which has high requirements for product quality and needs registration service; Central Asia, which requires extremely exquisite packaging design and packaging material quality;<br />Southeast Asia, which requires professional services and accurate product recommendations; Africa, which attaches great importance to product effects, etc.",
  "人才招聘": "Recruitment",
  "人才招聘介绍": "Due to the rapid development of the company's business, we warmly invite you to join us!<br />You will be in front of the most caring customers in the world who share our commitment to protecting plants, ecology and the world!<br />Your career plan will become clear and firm. We will provide you with full, patient and professional training to cultivate your sense of responsibility and ability!<br /><br />10 foreign trade salesmen<br />4 quality inspectors<br />2 warehouse managers<br /><br/>Looking forward to working with you to create a better tomorrow!",
  "联系我们": "Contact Us",
  "联系我们介绍": "Shanghai AgroWonderful Industrial Co., Ltd<br />Address: Room 205, West District, 2nd Floor, No. 707 Zhangyang Road, Shanghai Pilot Free Trade Zone, China<br />Postcode: 200120<br />E-mail: agrowonderful@foxmail.com<br />Cellphone No./WhatsAPP/Wechat: +86 173 4977 1657<br />Above is the fastest and most convenient way for you to contact us, we guarantee to reply you within 4 working hours!",
  "产品中心": "Product Center",
  "技术方案": "Technical solutions",
  "原药和制剂的区别": "What is the difference between TC and formulation products",
  "原药和制剂的区别描述": "To put it simply, TC is insoluble in water, and can only be used as a pesticide after secondary processing in the factory into a formulation. The formulation can be diluted with water and used directly.",
  "原药和制剂的区别介绍": "",
  "大包装和小包装的区别": "What is the difference between bulk and small packages",
  "大包装和小包装的区别描述": "In terms of form, pesticides are divided into solid and liquid.",
  "大包装和小包装的区别介绍": "Solid bulk packaging : 25KG/drum, 25KG/bag.<br />Solid small packages :100g/aluminum foil bag, 250g/aluminum foil bag, 500g/aluminum foil bag, 1KG/aluminum foil bag, etc.<br />Liquid bulk packs : 1 ton/barrel , 200L/barrel.<br />Liquid small packages: 20L/barrel, 5L/barrel, 1L/bottle, 250ml/bottle, 100ml/bottle, etc.",
  "不同剂型有什么区别": "What is the difference between the different formulation types",
  "不同剂型有什么区别描述": "Solid pesticide formulations include WDG, WP, SP, SG, GR, etc.",
  "不同剂型有什么区别介绍": "Liquid pesticide formulations include SL, EC, SC, FS, TK, etc.<br />Different formulations and different forms of pesticides have their own characteristics, which need to be analyzed according to the control objects and places of use.",
  "如何判断农药质量的好坏": "How to judge the quality of pesticides",
  "如何判断农药质量的好坏描述": "Our factory has strict technical standards for the production of pesticides, and will conduct at least 3 internal sampling inspections and 1 third-party inspection.",
  "如何判断农药质量的好坏介绍": "①Emulsion concentrate: stable and uniform, no stratification, no emulsifiable concentrate on top, and no precipitation on the bottom.<br />②Wettable powder: powdery, not agglomerated.<br />③Water agent: stable and uniform, no stratification, no suspension, no precipitation.<br />④Suspension: flowable body, uniform without precipitation, shaken for 15 minutes without caking.<br />⑤Water-soluble powder: powdery, not agglomerated.<br />⑥Smoke agent: powder, no flame after burning.",
  "一条柜可以装多少数量的农药": "How many pesticides can one container hold",
  "一条柜可以装多少数量的农药描述": "One 20-foot small container can hold 12 to 16 tons of pesticides, and one 40-foot high container can hold 16 to 22 tons of pesticides. The specific needs are judged according to the volume and weight of the pesticide. Please contact our professional salesperson to help you calculate.",
  "一条柜可以装多少数量的农药介绍": "",
  "你们支持登记吗": " Do you support registration",
  "你们支持登记吗描述": "We are factory and support registration. Please contact our professional salesman, we have a professional registration department to provide the information you need.",
  "你们支持登记吗介绍": "",
  "农技中心：科学安全使用农药技术要点": "Agricultural Technology Center: Technical Key Points for the Scientific and Safe Use of Pesticide",
  "农技中心：科学安全使用农药技术要点描述": "The scientific use of pesticides can effectively control crop diseases and insect pests to ensure agricultural harvests, but if used improperly, it will also bring certain side effects, such as destroying the ecological balance of farmland, increasing pesticide residues in agricultural products and environmental pollution, and sometimes causing phytotoxicity to crops. The occurrence of human and animal poisoning accidents. So, how to use pesticides scientifically and safely?",
  "农技中心：科学安全使用农药技术要点介绍": "1. Choose the right pesticide. When pests, weeds, and rats appear in the field, the first thing to do is to make a diagnosis based on their characteristics and damage symptoms. It is necessary to identify the types of pests and diseases, choose the right pesticides, use rational drugs, and prescribe the right medicines to prevent misuse of pesticides due to misdiagnosis, which not only delays the prevention and control period, but also increases the amount of pesticide residues on crops.<br />2. Choose the best spraying time. Different crops or different varieties of a crop have different sensitivities to pesticides, and if a certain pesticide is applied to sensitive crops or varieties, phytotoxicity will occur. After selecting the control pesticide, it is necessary to grasp the best control period according to the growth cycle of the crop and the occurrence of pests and diseases, and scientifically formulate it in strict accordance with the concentration indicated on the pesticide package.<br />3. Choose the best dosage. When spraying pesticides, the dosage is too large, which is easy to cause phytotoxicity; the dosage is too small, and the control effect cannot be achieved. In order to use pesticides scientifically and rationally, the best spraying dosage must be selected. The dosage of pesticides recommended by the pesticide label can be used. Or the amount used under the guidance of plant protection technicians.<br />4. Choose the appropriate spraying method. There are various formulations of pesticides, and their application methods are also different. In production, the appropriate application method must be selected according to the hazard characteristics and distribution of the pests and the provisions of the pesticide product label or instruction manual, otherwise it will be difficult to control the harm of pests and diseases. For example, to control soil-borne pathogens, weed seeds, underground pests, etc., methods such as chemical treatment of the soil, ditching and spreading should be used for better results; for the prevention and control of pests that harm plants, spraying or dusting methods should be used; Seed-borne diseases are better treated with chemical seed soaking or seed dressing.<br />5. Select the applicator with good performance. The selection of pesticide application equipment should comprehensively consider the control objects, control sites, growth conditions of crop species, pesticide formulations, control methods, and control scales. For example, when spraying pesticides in small areas, manual sprayers should be used; when spraying pesticides in large areas, motorized sprayers should be used; Or fan-shaped fog nozzles, after the spraying operation, the equipment should be carefully cleaned and maintained.<br />6. Alternate and rotate medication. If a single pesticide is used for a long time, it is easy for the pests to develop resistance. However, in order to improve the control effect in production, some farmers will increase the amount of pesticides, resulting in an increase in the amount of pesticide residues in crops. Therefore, alternate rotation or compounding of pesticides can delay the emergence of pesticide resistance and effectively improve the control effect.<br />7. Properly mix pesticides. The rational mixing of pesticides can improve the application effect, expand the scope of application, treat a variety of pests, reduce the dosage, improve the efficacy, reduce the toxicity and slow down the resistance of the pests to the pesticides. Mixing principles: complementary advantages, enhance efficacy; avoid antagonism; mix a single dose should not exceed three;<br />8. Strictly grasp the safe production interval. The safety interval refers to the shortest time between the last use of pesticides and the harvesting and listing of agricultural products. During this period, the toxic substances of most pesticides will be gradually degraded due to factors such as photosynthesis, and the pesticide residues will reach the safety standard and will not cause harm to human health. harm. The length of the safety interval should be determined by the pesticide type, concentration, application method, climatic conditions and crop varieties. Different varieties of pesticides have different safety intervals.<br />",
  "新闻中心": "News Center",
  "农业农村部部署春季小麦条锈病防控": "Ministry of Agriculture and Rural Affairs deploys spring wheat stripe rust prevention and control",
  "2022年3月14日": "March 14, 2022",
  "中国、柬埔寨、缅甸、巴基斯坦、越南五国联合发布共建“一带一路”农药产品质量标准合作意向声明": "China, Cambodia, Myanmar, Pakistan, and Vietnam jointly issued a statement of intent to jointly build the 'Belt and Road' pesticide product quality standard cooperation",
  "2021年7月6日": "July 6, 2021",
  "2020年中央一号文件公布": "Announcement of the 2020 Central Document No. 1 ",
  "2020年2月5日": "February 5, 2020",
  "关于印发《2019年农药管理工作要点》的通知": "Notice on Printing and Distributing 'Key Points of Pesticide Management in 2019'",
  "2019年3月8日": "March 8, 2019",
  "农药抽检总体合格率99.7%": "The overall pass rate of pesticide sampling inspection was 99.7%",
  "2018年10月12日": "October 12, 2018",
  "新闻1标题": "Why has the price of glyphosate fluctuated so much in the past two years? What will the future market look like?",
  "新闻1时间": "by admin on 22-05-23",
  "新闻1内容": "Glyphosate is a biocidal herbicide that has good herbicidal effects on annual and perennial weeds. It is the main herbicide currently used in corn and other crops.<br />Glyphosate is the single product with the largest proportion of herbicide consumption in the world, accounting for about 30% of the global herbicide market, accounting for 15% of the total global pesticide consumption, and the product market value is 6 billion US dollars.<br />China is a major producer of glyphosate. In 2021, the global nominal production capacity of glyphosate will be 1.192 million tons, of which 732,000 tons will be concentrated in China. The overseas production capacity is 460,000 tons, mainly concentrated in Bayer, with a production capacity of about 370,000 tons.<br />Since 2021, multiple force majeures have frequently catalyzed the upward trend of glyphosate prices. For example, the floods in Sichuan in 2020 caused many glyphosate companies to stop production, and there was a large gap in the supply side. Domestic glyphosate went through a rapid destocking stage. In the first half of 2021, the United States was affected by Hurricane Ida, and Bayer's factory in New Orleans stopped production, which intensified the global supply of glyphosate, triggering panic buying in the market, and the price of glyphosate jumping high.<br />In the third quarter, affected by the double control of energy consumption, the price of glyphosate jumped to 80,000/ton. With the weakening of the marginal impact of the dual control of energy consumption, the price of glyphosate has gradually dropped to the current 63,000-65,000/ton. Currently, the inventory of domestic manufacturers is still at a low level for many years.<br />Paraquat is a bipyridyl herbicide with the characteristics of low price and rapid action, and has become the second largest herbicide in the world. However, it is highly toxic to mammals, the damage is irreversible after poisoning, and it remains in the land for a long time. It has been banned in more than 48 countries.<br />Recently, due to the impact of the epidemic, poor logistics has led to the accumulation of inventory, but judging from the order situation feedback from downstream, most manufacturers have signed orders in June 2022. There is still some support on the demand side, and glyphosate stocks are still significantly lower than the same period in previous years. Therefore, in the short to medium term, glyphosate will still be in a boom stage.",
  "新闻2标题": "The mainstream development direction in the future——Aryloxyphenoxypropionate herbicides",
  "新闻2时间": "By admin at 22-07-17",
  "新闻2内容": "<table><thead><tr><th>Product name</th><th>Share%</th><th>Sales ($100 million)</th></tr></thead><tbody><tr><td>fenoxaprop</td><td>18.5</td><td>2.25</td></tr><tr><td>clodinafop</td><td>16.8</td><td>2.05</td></tr><tr><td>fluazifop</td><td>13.6</td><td>1.65</td></tr><tr><td>quizalofop</td><td>13.6</td><td>1.65</td></tr><tr><td>haloxyfop</td><td>13.1</td><td>1.60</td></tr><tr><td>cyhalofop-butyl</td><td>12.7</td><td>1.55</td></tr><tr><td>Other</td><td>11.7</td><td>1.40</td></tr><tr><td>In total</td><td>100.0</td><td>12.17</td></tr></tbody></table><br />Aryloxy phenoxy propionate (APP) herbicides are mainly used for the control of grass weeds.<br />1. Clodinafop-propargyl<br />Clodinafop-propargyl is a fluorine-containing, optically active aryloxyphenoxypropionate herbicide. Post-emergence stem and leaf treatment can control grass weeds in cereal fields such as wheat, rye and triticale, especially for Highly effective against intractable weeds such as wild oats. It is used for post-emergence stem and leaf treatment to control annual grass weeds, such as wild oat, black oat grass, foxtail, scorpion grass and sagebrush. Customs data shows that in 2019, my country exported a total of 35.77 million US dollars (incomplete statistics, including preparations and technical drugs), of which the country with the largest import was Kazakhstan, and the import was mainly preparations, with a value of 8.6515 million US dollars, and the second was Russia, preparations. There is demand for both and original medicine, and the import volume is 3.6481 million US dollars.<br />2. Cyhalofop-butyl<br />Cyhalofop-butyl is a special herbicide for rice developed and produced by Dow AgroSciences in 1987. Dow's trade name is Clincher. Active ingredient: 10% Cyhalofop-ethyl EC. Rice hi ( 60g/L Cyhalofop-butyl + Penoxsulam). Mainly absorbed through foliar, no soil activity. Cyhalofop-butyl is systemic and is rapidly absorbed through plant tissues. After the chemical treatment, the grass weeds stopped growing immediately, yellowing appeared within 2 to 7 days, and the whole plant necrotic and died within 2 to 3 weeks. In 2019, the customs data showed that my country exported cyhalofop-ethyl 20.8 million US dollars (including preparations and technical drugs), of which Vietnam was the largest importer, importing 4.845 million US dollars (mostly preparations).<br />3. Quizalofop-p-ethyl<br />Quizalofop-p-ethyl is a highly selective dry field stem and leaf treatment agent, suitable for soybean, sugar beet, rape, cotton, peanut, broad-leaved vegetables and other crops and fruit trees, mainly used for the control of wild oats, barnyard grass , foxtail grass, golden foxtail grass, crabgrass, wild millet, beef tendon grass, kangaroo, teff, lily and other annual and perennial grass weeds. In 2019, my country's customs data showed that a total of 51.636 million US dollars of quizalofop-ethyl was exported, of which the largest destination country was Ukraine, with a total export of 8.957 million US dollars, followed by Russia, with a total export of 7.782 million US dollars.<br />4. fenoxaprop-p-ethyl<br />Oxafen-ethyl was originally a product of Bayer. It is suitable for controlling monocotyledonous weeds in the fields of dicotyledonous crops such as soybean, peanut, rape, cotton, sugar beet, flax, potato, vegetable field and mulberry orchard. In 2019, my country exported a total of 51.635 million U.S. dollars (including preparations and technical drugs) of fenoxafen dollars.<br />5. High-efficiency haloxyfop-P-methyl<br />Symptoms of weed infestation were observed 48 hours after application. First, the meristem parts such as buds and nodes begin to brown, and then the heart leaves gradually turn purple and yellow until the whole plant dies. Older leaves show symptoms later, turning purple, orange or red before withering. It generally takes 6 to 10 days from application to weed death. It is used for the control of grass weeds such as barnyardgrass, barnyardgrass, crabgrass, foxtail, beef tendon, and wild oats in broad-leaved crops such as soybeans, cotton, peanuts, rapeseed and cabbage. It is highly safe for broad-leaved crops. According to incomplete statistics, in 2019, my country exported a total of 66.6548 million U.S. dollars of high-efficiency flufenoxazole, of which the largest destination country was Argentina, with an export value of 26.705 million U.S. dollars.",
  "新闻3标题": "Global pesticide sales of US$70 billion in 2020, China ranks third",
  "新闻3时间": "by admin on 21-03-01",
  "新闻3内容": "According to IHSMarkit pesticide market analysis data (with technical support from Phillips McDougall), global crop pesticide sales (at the ex-factory level) in 2020 were US$62.036 billion, a year-on-year increase of 2.7%; if inflation and exchange rate effects were excluded, the growth rate expanded to 12.9%. As the world's largest pesticide country, the devaluation of the Brazilian currency Real has become a major factor affecting the global pesticide market. In addition, weather conditions, the new crown epidemic, etc. have become important factors.<br />In 2020, the global non-crop pesticide sales were US$7.850 billion, a year-on-year increase of 0.6%, which was lower than the growth level of the crop pesticide market. For southern hemisphere countries, pesticide sales are based on the 2019/20 agricultural year, not the 2020 calendar year.<br /><br />1. Herbicides dominate<br />In 2020, the global sales of herbicides for crops was US$27.407 billion, a year-on-year increase of 2.9%, accounting for 44.2% of the global crop pesticide market. This increase was mainly due to the increase in soybean and corn acreage.<br />In 2020, the global sales of fungicides for crops was US$16.804 billion, a year-on-year increase of 2.4%, accounting for 27.1% of the global crop pesticide market.<br />In 2020, the global sales of pesticides for crops was US$15.681 billion, a year-on-year increase of 3.1%, accounting for 25.3% of the global pesticide market for crops. In the Middle East, Africa and Asia, the occurrence of insect pests is relatively serious, especially the outbreak of locusts and the occurrence of Spodoptera frugiperda.<br />In 2020, the sales of other products were US$2.144 billion, a year-on-year increase of 0.6%, and accounted for 3.5% of the global crop pesticide market. This part of the products includes: plant growth regulators, fumigants and pheromones. These products are widely used in crops, among which the three major crop series of fruits and vegetables, grains and cotton dominate.<br /><br />2. The Asia-Pacific market is the largest in the world<br />The Asia-Pacific region remains the world's largest crop pesticide market, with sales of US$19.241 billion in 2020, a year-on-year increase of 3.8%, accounting for 31.0% of the global crop pesticide market. The growth of the market in this region is mainly benefited by favorable monsoon weather in India, and in general, the increase in pest infestation, especially the infestation of the desert locust (Schistocerca gregaria) and the spread of the fall armyworm (Spodoptera frugiperda), has promoted the market Demand for pesticides.<br />In 2020, the sales of pesticides in Latin America were US$16.058 billion, a year-on-year increase of 2.1%, accounting for 25.9% of the global crop pesticide market. This growth was mainly driven by the growth of the Brazilian market, which is the largest pesticide market in the world.<br />Since the beginning of 2019, 28 active ingredients in the EU have lost their registration, and the promotion of alternative products has been slow, so the European market has stagnated. In 2020, pesticide sales in Europe were US$12.778 billion, a year-on-year increase of only 1.6%, accounting for 20.6% of the global crop pesticide market.<br /><br />3. The third place in China's top 20 pesticides<br />In 2020, the ranking of the world's leading countries in pesticides has barely changed. Brazil remains the world's largest pesticide market, with pesticide sales of US$11.309 billion in 2019/20, a year-on-year increase of 3.6%. It was followed by the United States, with pesticide sales of $8.460 billion, up 3.4% year-on-year. This is followed by major Asia-Pacific countries such as China, Japan and India. In 2020, pesticide sales in China were US$7.821 billion, a year-on-year increase of 4.1%.",
  "新闻4标题": "Take you to unlock the pesticide varieties with global sales of over 200 million in 2019",
  "新闻4时间": "By admin at 20-01-09",
  "新闻4内容": "In the past ten years from 2006 to 2016, the market size of pesticides has grown from USD 38 billion to USD 56 billion at a compound growth rate of 4%; in the following ten years (2016-2026), it will expand to USD 80 billion at a compound growth rate of 3%. <br />Let's take a look at the pesticide varieties with a sales volume of 200 million in the world pesticide market in 2019:<br /><table><thead><tr><th></th><th>Item</th><th>Sales/$100 million</th><th>Item</th><th>Sales/$100 million</th></tr></thead><tbody><tr><td rowspan='7'>Herbicide</td><td>Glyphosate</td><td>31.85</td><td>Pendimethalin</td><td>2.80</td></tr><tr><td>Acetochlor</td><td>4.50</td><td>Mesotrione</td><td>2.70</td></tr><tr><td>Metolachlor</td><td>3.85</td><td>Glufosinate</td><td>2.45</td></tr><tr><td>Paraquat</td><td>3.85</td><td>Sulfosate</td><td>2.10</td></tr><tr><td>2,4-D</td><td>3.05</td><td>trifluralin</td><td>2.00</td></tr><tr><td>Oxafenox</td><td>2.95</td><td>imazethapyr</td><td>2.00</td></tr><tr><td>Atrazine</td><td>2.95</td><td>Dicamba</td><td>2.00</td></tr><tr><td rowspan='3'>Insecticide</td><td>Imidacloprid</td><td>8.20</td><td>Fipronil</td><td>2.85</td></tr><tr><td>Chlorpyrifos</td><td>3.90</td><td>Deltamethrin</td><td>2.30</td></tr><tr><td>Thiamethoxam</td><td>2.98</td><td>Lambda cypermethrin</td><td>2.10</td></tr><tr><td rowspan='4'>Fungicide</td><td>Tebuconazole</td><td>5.75</td><td>pyraclostrobin</td><td>2.95</td></tr><tr><td>Azoxystrobin</td><td>5.05</td><td>Trioxystrobin</td><td>2.55</td></tr><tr><td>Epoxiconazole</td><td>3.95</td><td>Chlorothalonil</td><td>2.40</td></tr><tr><td>Mancozeb</td><td>3.40</td><td>copper preparation</td><td>2.25</td></tr></tbody></table><br />The agrochemical market will show a slow growth trend in the long run.<br />The world population statistics from the World Bank show that the current world population is still in the process of steady growth. It is expected that the world population will reach a peak of about 10 billion around 2050, the demand for food will increase by about 30%, and the production efficiency of agricultural products needs to increase. More than 70% of the food needs of the world's population growth will be met.",
  "服务": "Services",
  "ICAMA": "ICAMA",
  "ICAMA介绍": "We are a factory and can handle and provide ICAMA(Institute for the Control of Agrochemicals, Ministry of Agriculture) for you. We cooperate with professional GLP laboratories, and can also provide you with the required information for registration of 5 batches of GLP and 6 toxicological toxicity reports and other documents for registration.",
  "OEM定制": "OEM Package",
  "OEM定制介绍": "We are a factory with professional designers who can design packaging for you free of charge and produce according to your packaging, brand and logo. If you don't need OEM, we also provide our own brand AgroWonderful for you to choose.",
  "运输": "Transportation",
  "运输介绍": "We focus on production and export, have rich export experience, have our own trailer team and freight forwarding team, and provide double clearance service.",
  "地址": "Address",
  "中国上海自贸试验区张杨路707号二层西区205室": "Room 205, West District, 2nd Floor, No. 707 Zhangyang Road, Shanghai Pilot Free Trade Zone, China",
  "邮编": "Postcode",
  "语言": "language:",
  "中文": "Chinese",
  "英语": "English",
  "上一篇": "prev:",
  "下一篇": "next:",
  "全球服务热线": "Global service hot line",
  "杀虫剂1": "methomyl",
  "杀虫剂1详情": "Production name: methomyl<br />Function: insecticide<br />Specification:methomyl 98% TC/methomyl 90% SP/methomyl 40% SP/methomyl 20% EC etc.<br />Chemical name:  methyl N-[[(methylamino)carbonyl]oxy]ethanimidothioate <br />CAS#:16752-77-5<br />Empirical Formmula:C5H10N2O2S<br />Application: Systemic insecticide and acaricide with contact and stomach action.  Uses Control of a wide range of insects (particularly Lepidoptera, Hemiptera, Homoptera, Diptera and Coleoptera) and spider mites in fruit, vines, olives, hops, vegetables, ornamentals, field crops, cucurbits, flax, cotton, tobacco, soya beans, etc. Also used for control of flies in animal and poultry houses and dairies.<br />Formulation types: TC/SP/EC<br />Package: 100ml/bottle,250ml/bottle,500ml/bottle,1L/bottle,20L/drum,200L/drum,100g/bag,250g/bag,500g/bag,1KG/bag,25KG/drum,etc.",
  "杀虫剂2": "avermectin",
  "杀虫剂2详情": "Production name: abamectin/avermectin B1<br />Function: insecticide<br />Specification: abamectin 95%TC/abamectin 36g/l EC/abamectin 19g/l EC/abamectin 18g/l EC etc.<br />Chemical name: 5-O-demethylavermectin A1a (i) mixture with 5-O-demethyl-25-de(1-methylpropyl)-25-(1-methylethyl)avermectin A1a<br />CAS#: 71751-41-2<br />Empirical Formmula: C48H72O14 (avermectin B1a); C47H70O14 (avermectin B1b)<br />Application: Insecticide and acaricide with contact and stomach action. Has limited plant systemic activity, but exhibits translaminar movement.  Uses Control of motile stages of mites, leaf miners, suckers, Colorado beetles, etc. on ornamentals, cotton, citrus fruit, pome fruit, nut crops, vegetables, potatoes, and other crops. Application rates are 5.6 to 28 g/ha for mite control, 11 to 22 g/ha for control of leaf miners. Also used for control of fire ants<br />Formulation types: TC/EC<br />Package: 100ml/bottle,250ml/bottle,500ml/bottle,1L/bottle,20L/drum,200L/drum,100g/bag,250g/bag,500g/bag,1KG/bag,25KG/drum,etc.",
  "杀虫剂3": "fipronil",
  "杀虫剂3详情": "Production name: fipronil<br />Function: insecticide<br />Specification: fipronil 97% TC/fipronil 80% WDG/fipronil 200g/l SC/fipronil 25g/l EC<br />Chemical name: 5-amino-[2,6-dichloro-4-(trifluoromethyl)phenyl]-4-[(1R,S)-(trifluoromethyl)sulfinyl]-1H-pyrazole-3-carbonitrile<br />CAS#:120068-37-3<br />Empirical Formmula: C12H4Cl2F6N4OS<br />Application: Broad-spectrum insecticide, toxic by contact and ingestion. Moderately systemic and, in some crops, can be used to control insects when applied as a soil or seed treatment. Good to excellent residual control following foliar application.<br />Formulation types: TC/WDG/SC/EC<br />Package: 100ml/bottle,250ml/bottle,500ml/bottle,1L/bottle,20L/drum,200L/drum,100g/bag,250g/bag,500g/bag,1KG/bag,25KG/drum,etc.",
  "杀虫剂4": "Amitraz",
  "杀虫剂4详情": "Production name: Amitraz<br />Function: insecticide<br />Specification: Amitraz 98%TC,Amitraz 80%WDG,Amitraz 200g/l EC,Amitraz 250g/l SL etc<br />Chemical name: N'-(2,4-dimethylphenyl)-N-[[(2,4-dimethylphenyl)imino]methyl]-N-methylmethanimidamide <br />CAS#: 33089-61-1<br />Empirical Formmula: C19H23N3<br />Application: Non-systemic, with contact and respiratory action. Expellent action causes ticks to withdraw mouthparts rapidly and fall off the host animal.  Uses Control of all stages of tetranychid and eriophyid mites, pear suckers, scale insects, mealybugs, whitefly, aphids, and eggs and first instar larvae of Lepidoptera on pome fruit, citrus fruit, cotton, stone fruit, bush fruit,strawberries,hops, cucurbits, aubergines, capsicums, tomatoes, ornamentals, and some other crops. Also used as an animal ectoparasiticide to control ticks, mites and lice on cattle, dogs, goats, pigs and sheep.<br />Formulation types: TC/WDG/EC/SL<br />Package: 100ml/bottle,250ml/bottle,500ml/bottle,1L/bottle,20L/drum,200L/drum,100g/bag,250g/bag,500g/bag,1KG/bag,25KG/drum,etc.",
  "除草剂1": "weed killer 24D",
  "除草剂1详情": "Production name: 24D/2,4D/2,4-D<br />Function: herbicide<br />Specification: 24D 98% TC,24D 860g/l SL,24D 720g/l SL etc.<br />Chemical name: (2,4-dichlorophenoxy)acetic acid<br />CAS#: 94-75-7<br />Empirical Formmula: C8H6Cl2O3<br />Application: Post-emergence control of annual and perennial broad-leaved weeds in cereals, maize, sorghum, grassland, established turf, grass seed crops, orchards (pome fruit and stone fruit), cranberries, asparagus, sugar cane, rice, forestry, and on non-crop land (including areas adjacent to water), at 0.28-2.3 kg/ha. Control of broad-leaved aquatic weeds. <br />Formulation types: EC/GR/SP/SL<br />Package: 100ml/bottle,250ml/bottle,500ml/bottle,1L/bottle,20L/drum,200L/drum,100g/bag,250g/bag,500g/bag,1KG/bag,25KG/drum,etc.",
  "除草剂2": "grass killer glifosato glyphosate roudup WDG WG",
  "除草剂2详情": "Production name: glifosato/glyphosate/roudup/round up<br />Function: herbicide<br />Specification: glyphosate 95% TC,glyphosate 360g/l SL,glyphosate 480g/l SL,glyphosate 75.7% SG,glyphosate 62% SL etc.<br />Chemical name: N-(phosphonomethyl)glycine<br />CAS#: 1071-83-6<br />Empirical Formmula:C3H8NO5P<br />Application: Non-selective systemic herbicide, absorbed by the foliage, with rapid translocation throughout the plant. Inactivated on contact with soil.Control of annual and perennial grasses and broad-leaved weeds, pre-harvest, in cereals, peas, beans, oilseed rape, flax and mustard, at c. 1.5-2 kg/ha; control of annual and perennial grasses and broad-leaved weeds in stubble and post-planting/pre-emergence of many crops; as a directed spray in vines and olives, at up to 4.3 kg/ha; in orchards, pasture, forestry and industrial weed control, at up to 4.3 kg/ha. As an aquatic herbicide, at c. 2 kg/ha.<br />Formulation types: SL,SG,TC<br />Package: 100ml/bottle,250ml/bottle,500ml/bottle,1L/bottle,20L/drum,200L/drum,100g/bag,250g/bag,500g/bag,1KG/bag,25KG/drum,25KG/bag etc.",
  "除草剂3": "metribuzin SC",
  "除草剂3详情": "Production name: metribuzin/Lexone<Br />Function: herbicide<br />Specification: metribuzin 95%TC/metribuzin 70%WP/metribuzin 75%WDG/metribuzin 480g/l SC etc.<Br />Chemical name:metribuzin<br />CAS#:21087-64-9<br />Empirical Formmula:C8H14N4OS<br />Application: Selective systemic herbicide, absorbed predominantly by the roots, but also by the leaves, with translocation acropetally in the xylem.  Uses Pre- and post-emergence control of many grasses and broad-leaved weeds in soya beans, potatoes, tomatoes, sugar cane, alfalfa, asparagus, maize and cereals, at 0.07-1.45 kg/ha. Phytotoxicity Phytotoxic to many crops, including crucifers, cucurbits, lettuce, onions, sugar beet, sunflowers, flax, strawberries, sweet potatoes, and tobacco.<Br />Formulation types: TC,WP,WDG/WG/SC<br />Package: 100ml/bottle,250ml/bottle,500ml/bottle,1L/bottle,20L/drum,200L/drum,100g/bag,250g/bag,500g/bag,1KG/bag,25KG/drum,etc.",
  "除草剂4": "Bentazone bendioxide herbicide",
  "除草剂4详情": "Production name: Bentazone/bentazon/bendioxide<br />Function: herbicide<br />Specification:bentazone 97%TC/bentazone 480g/l SL etc.<br />Chemical name:3-(1-methylethyl)-1H-2,1,3-benzothiadiazin-4(3H)-one 2,2-dioxide<br />CAS#:25057-89-0<br />Empirical Formmula: C10H12N2O3S<br />Application:Selective contact herbicide, absorbed mainly by the foliage, with very little translocation, but also absorbed by the roots, with translocation acropetally in the xylem.  Uses A contact herbicide controlling Anthemis, Chamomilla and Matricaria spp., Chrysanthemum segetum, Galium aparine, Lapsana communis and Stellaria media in winter and spring cereals, at 1.0-2.2 kg/ha.<br />Formulation types: TC,SL<br />Package: 100ml/bottle,250ml/bottle,500ml/bottle,1L/bottle,20L/drum,200L/drum,100g/bag,250g/bag,500g/bag,1KG/bag,25KG/drum,etc.",
  "杀菌剂1": "tebuconazole",
  "杀菌剂1详情": "Production name: tebuconazole/fenetrazole/terbutrazole/ethyltrianol<br />Function: fungicide<Br />Specification: tebuconazole 97%TC,tebuconazole 80% WP,tebuconazole250g/l EC,tebuconazole 250g/l EW,tebuconazole 120g/l FS etc<br />Chemical name:(+/-)-alpha-(2-(4-chlorophenyl)ethyl)-alpha-(1,1-dimethylethyl)-1H-1,2,4-triazol-1-ethanol  <br />CAS#:107534-96-3<br />Empirical Formmula: C16H22ClN3O<br />Application: Systemic fungicide with protective, curative, and eradicant action. Rapidly absorbed into the vegetative parts of the plant, with translocation principally acropetally. Uses As a seed dressing, tebuconazole is effective against various smut and bunt diseases of cereals such as Tilletia spp., Ustilago spp., and Urocystis spp., also against Septoria nodorum (seed-borne), at 1-3 g/dt seed; and Sphacelotheca reiliana in maize, at 7.5 g/dt seed.<br />Formulation types: TC/WP/EC/EW/FS<Br />Package: 100ml/bottle,250ml/bottle,500ml/bottle,1L/bottle,20L/drum,200L/drum,100g/bag,250g/bag,500g/bag,1KG/bag,25KG/drum,etc.",
  "杀菌剂2": "difenoconazole FS",
  "杀菌剂2详情": "Production name: difenoconazole <br />Function: fungicide<br />Specification: difenoconazole 95% TC,difenoconazole 300g/l SC,difenoconazole 250g/l EC,difenoconazole 10%WDG,difenoconazole 60g/l FS etc<br />Chemical name: 1-[2-[2-chloro-4-(4-chlorophenoxy)phenyl]-4-methyl-1,3-dioxolan-2-ylmethyl]-1H-1,2,4-triazole<br />CAS#:119446-68-3<br />Empirical Formmula:C19H17Cl2N3O3 <br />Application: Systemic fungicide with preventive and curative action. Absorbed by the leaves, with acropetal and strong translaminar translocation.  Uses Systemic fungicide with a novel broad-range activity protecting the yield and crop quality by foliar application or seed treatment. Provides long-lasting preventive and curative activity against Ascomycetes, Basidiomycetes and Deuteromycetes<br />Formulation types: TC/SC/EC/WDG/FS<br />Package: 100ml/bottle,250ml/bottle,500ml/bottle,1L/bottle,20L/drum,200L/drum,100g/bag,250g/bag,500g/bag,1KG/bag,25KG/drum,etc.",
  "杀菌剂3": "azoxystrobin",
  "杀菌剂3详情": "Production name: azoxystrobin <br />Function: fungicide<br />Specification: azoxystrobin 95% TC,azoxystrobin 80% WDG,azoxystrobin 50%WDG,azoxystrobin 250g/l SC,azoxystrobin 100g/l FS etc<br />Chemical name: methyl (E)-2-[[6-(2-cyanophenoxy)-4-pyrimidinyl]oxy]-a-(methoxymethylene)benzeneacetate  <br />CAS#: 131860-33-8<br />Empirical Formmula:C22H17N3O5<br />Application: Fungicide with protectant, curative, eradicant, translaminar and systemic properties. Inhibits spore germination and mycelial growth, and also shows antisporulant activity.  Uses Controls the following pathogens at application rates between 100 to 375 g/ha: Erysiphe graminis, Puccinia spp., Leptosphaeria nodorum, Septoria tritici and Pyrenophora teres on temperate cereals; Pyricularia oryzae and Rhizoctonia solani on rice<br />Formulation types: TC/WDG/SC/FS<br />Package: 100ml/bottle,250ml/bottle,500ml/bottle,1L/bottle,20L/drum,200L/drum,100g/bag,250g/bag,500g/bag,1KG/bag,25KG/drum,etc.",
  "杀菌剂4": "chlorothalonil",
  "杀菌剂4详情": "Production name: chlorothalonil <br />Function: fungicide<br />Specification: chlorothalonil 95% TC,chlorothalonil 75% WP,chlorothalonil 500g/l SC,chlorothalonil 100g/l EC etc<br />Chemical name:2,4,5,6-tetrachloro-1,3-benzenedicarbonitrile  <br />CAS#:1897-45-6<br />Empirical Formmula: C8Cl4N2<br />Application: Non-systemic foliar fungicide with protective action.  Uses Control of many fungal diseases in a wide range of crops, including pome fruit, stone fruit, citrus fruit, bush and cane fruit, cranberries, strawberries, pawpaws, bananas, mangoes, coconut palms, oil palms, rubber, pepper, vines, hops, vegetables, cucurbits, tobacco, coffee, tea, rice, soya beans, peanuts, potatoes, sugar beet, cotton, maize, ornamentals, mushrooms, and turf. Application rates for food crops are 1-2.5 kg/ha.<br />Formulation types: TC/WP/SC/EC<br />Package: 100ml/bottle,250ml/bottle,500ml/bottle,1L/bottle,20L/drum,200L/drum,100g/bag,250g/bag,500g/bag,1KG/bag,25KG/drum,etc.",
  "植物生长调节剂1": "growth hormone ethylene ripener SL",
  "植物生长调节剂1详情": "Production name: ethylene/ethephon/ripener/chorethephon <br />Function: plant growth regulator<br />Specification: ethylene 85% TC,ethylene 400g/l SL,ethylene 300g/l SL etc<br />Chemical name: (2-chloroethyl)phosphonic acid<br />CAS#:16672-87-0<br />Empirical Formmula: C2H6ClO3P <br />Application: Plant growth regulator with systemic properties. Penetrates into the plant tissues, and is decomposed to ethylene, which affects the growth processes. Uses To promote pre-harvest ripening in apples, currants, blackberries, blueberries, cranberries, morello cherries, citrus fruit, figs, tomatoes, sugar beet and fodder beet seed crops, coffee, capsicums, etc.; to accelerate post-harvest ripening in bananas, mangoes, and citrus fruit; to facilitate harvesting by loosening of the fruit in currants, gooseberries, cherries, and apples; to increase flower bud development in young apple trees; to prevent lodging in cereals, maize, and flax; to induce flowering of Bromeliads; to stimulate lateral branching in azaleas, geraniums, and roses; to shorten the stem length in forced daffodils; to induce flowering and regulate ripening in pineapples; to accelerate boll opening in cotton; to modify sex expression in cucumbers and squash; to increase fruit setting and yield in cucumbers; to improve the sturdiness of onion seed crops; to hasten the yellowing of mature tobacco leaves; to stimulate latex flow in rubber trees, and resin flow in pine trees; to stimulate early uniform hull split in walnuts; etc. Max. application rate per season 2.18 kg/ha for cotton, 0.72 kg/ha for cereals, 1.44 kg/ha for fruit. <Br />Formulation types: TC/SL<br />Package: 100ml/bottle,250ml/bottle,500ml/bottle,1L/bottle,20L/drum,200L/drum,100g/bag,250g/bag,500g/bag,1KG/bag,25KG/drum,etc.",
  "植物生长调节剂2": "Paclobutrazol SL",
  "植物生长调节剂2详情": "Production name: Paclobutrazol/growth hormone <Br />Function: plant growth regulator<br />Specification: Paclobutrazol 95% TC,Paclobutrazol 250g/l SC,Paclobutrazol 15% WP,etc<Br />Chemical name: 1H-1,2,4-Triazole-1-ethanol, beta-((4-chlorophenyl)methyl)-alpha-(1,1-dimethylethy l)-, (R*,R*)-(+-)- <br />CAS#:76738-62-0<Br />Empirical Formmula: C15H20ClN3O<Br />Application: Plant growth regulator taken up into the xylem through the leaves, stems, or roots, and translocated to growing sub-apical meristems. Produces more compact plants and enhances flowering and fruiting.  Uses Used on fruit trees to inhibit vegetative growth and to improve fruit set; on pot-grown ornamentals and flower crops (e.g. chrysanthemums, begonias, freesias, poinsettias and bulbs) to inhibit growth; on rice to increase tillering, reduce lodging, and increase yield; on turf to retard growth; and on grass seed crops to reduce height and prevent lodging. To be applied as a foliar spray, as a soil drench, or by trunk injection. Has some fungicidal activity against mildew and rusts.<br />Formulation types: TC/SC/WP<br />Package: 100ml/bottle,250ml/bottle,500ml/bottle,1L/bottle,20L/drum,200L/drum,100g/bag,250g/bag,500g/bag,1KG/bag,25KG/drum,etc.",
  "植物生长调节剂3": "GA3 tablet gibberellic acid",
  "植物生长调节剂3详情": "Production name: GA3/gibberellic acid<Br />Function: plant growth regulator<br />Specification: GA3 95% TC,GA3 20% SP,GA3 10% Tablet,GA3 5% Tablet,GA3 3% Tablet,etc<br />Chemical name: (1a,2b,4aa,4bb,10b)-2,4a,7-trihydroxy-1-methyl-8-methylenegibb-3-ene-1,10-dicarboxylic acid 1,4a-lactone<br />CAS#:77-06-5<br />Empirical Formmula: C19H22O6<br />Application: Acts as a plant growth regulator on account of its physiological and morphological effects in extremely low concentrations. Translocated. Generally affects only the plant parts above the soil surface.  Uses Has a variety of applications, e.g. to improve fruit setting of clementines and pears (especially William pears); to loosen and elongate clusters and increase berry size in grapes; to control fruit maturity by delaying development of the yellow colour in lemons; to reduce rind stain and retard rind ageing in navel oranges; to counteract the effects of cherry yellows virus diseases in sour cherries; to produce uniform seedling growth in rice; to promote elongation of winter celery crop.<br />Formulation types: TC/SP/Tablet<br />Package: 100ml/bottle,250ml/bottle,500ml/bottle,1L/bottle,20L/drum,200L/drum,100g/bag,250g/bag,500g/bag,1KG/bag,25KG/drum,etc.",
  "植物生长调节剂4": "thidiazuron",
  "植物生长调节剂4详情": "Production name: thidiazuron<br />Function: plant growth regulator<br />Specification: thidiazuron 97% TC,thidiazuron 50% WP etc<br />Chemical name: N-phenyl-N'-1,2,3-thiadiazol-5-ylurea<br />CAS#:51707-55-2<br />Empirical Formmula:C9H8N4OS<br />Application: Plant growth regulator, absorbed by the leaves, which stimulates formation of an abscission layer between the plant stem and the leaf petioles, causing the dropping of entire green leaves. Uses Used for defoliation of cotton, in order to facilitate harvesting; applied at 0.21 kg/ha per season.<br />Formulation types: TC/WP<br />Package: 100ml/bottle,250ml/bottle,500ml/bottle,1L/bottle,20L/drum,200L/drum,100g/bag,250g/bag,500g/bag,1KG/bag,25KG/drum,etc.",
  "原药1": "emamectin benzoate",
  "原药1详情": "Production name: emamectin benzoate<br />Function: insecticide<br />Specification: emamectin benzoate 70% TC,emamectin benzoate 5% WDG,emamectin benzoate 50g/l EC,emamectin benzoate19g/l EC etc<br />Chemical name:(4'R)-5-O-demethyl-4'-deoxy-4'-(methylamino)avermectin A1a + (4'R)-5-O-demethyl-25-de(1-methylpropyl)-4'-deoxy-4'-(methylamino)-25-(1-methylethyl)avermectin A1a (9:1)  <br />CAS#: 155569-91-8<br />Empirical Formmula: C49H75NO13 (B1a); C48H73NO13 (B1b)<br />Application: Non-systemic insecticide which penetrates leaf tissues by translaminar movement. Paralyses the lepidoptera, which stop feeding within hours of ingestion, and die 2-4 dat.  Uses For control of Lepidoptera on vegetables, brassicas and cotton, at up to 16 g/ha, and in pine trees, at 5-25 g/ha.<br />Formulation types: TC/WDG/EC<br />Package: 100ml/bottle,250ml/bottle,500ml/bottle,1L/bottle,20L/drum,200L/drum,100g/bag,250g/bag,500g/bag,1KG/bag,25KG/drum,etc.",
  "原药2": "imidacloprid",
  "原药2详情": "Production name: imidacloprid<br />Function: insecticide<br />Specification: imidacloprid 98% TC,imidacloprid 200g/l SL,imidacloprid 70% WDG,imidacloprid 70% WS,imidacloprid 25% WP etc<br />Chemical name: 1-[(6-chloro-3-pyridinyl)methyl]-N-nitro-2-imidazolidinimine <br />CAS#: 138261-41-3<br />Empirical Formmula: C9H10ClN5O2<br />Application: Systemic insecticide with translaminar activity and with contact and stomach action. Readily taken up by the plant and further distributed acropetally, with good root-systemic action.  Uses Control of sucking insects, including rice, leaf and planthoppers, aphids, thrips and whitefly. Also effective against soil insects, termites and some species of biting insects, such as rice water weevil and Colorado beetle. Has no effect on nematodes and spider mites. Used as a seed dressing, as soil treatment and as foliar treatment in different crops.<br />Formulation types: TC/SL/WDG/WS/WP<br />Package: 100ml/bottle,250ml/bottle,500ml/bottle,1L/bottle,20L/drum,200L/drum,100g/bag,250g/bag,500g/bag,1KG/bag,25KG/drum,etc.",
  "原药3": "diuron",
  "原药3详情": "Production name: diuron<br />Function: herbicide<br />Specification: diuron 98% TC,diuron 80% WP,diuron 80% WDG, diuron 800g/l SC etc<br />Chemical name: 1-[(6-chloro-3-pyridinyl)methyl]-N-nitro-2-imidazolidinimine <br />CAS#: 330-54-1<br />Empirical Formmula: C9H10Cl2N2O <br />Application: Systemic herbicide, absorbed principally by the roots, with translocation acropetally in the xylem.  Uses Total control of weeds and mosses on non-crop areas, at 10-30 kg/ha. Selective control of germinating grass and broad-leaved weeds in  many crops, including asparagus, tree fruit, bush fruit, citrus fruit, vines, olives, pineapples, bananas, sugar cane, cotton, peppermint, alfalfa, forage legumes, cereals, maize, sorghum, and perennial grass-seed crops, at 0.6-4.8 kg/ha. Phytotoxic residues in soil disappear within 1 season at these lower rates.<br />Formulation types: TC/WP/WDG/SC<br />Package: 100ml/bottle,250ml/bottle,500ml/bottle,1L/bottle,20L/drum,200L/drum,100g/bag,250g/bag,500g/bag,1KG/bag,25KG/drum,etc.",
  "原药4": "bifenthrin",
  "原药4详情": "Production name: bifenthrin<br />Function: insecticide<br />Specification: bifenthrin97% TC,bifenthrin 200g/l FS,bifenthrin 100g/l EC,bifenthrin 25g/l EC etc<br />Chemical name: (2-methyl[1,1'-biphenyl]-3-yl)methyl 3-(2-chloro-3,3,3-trifluoro-1-propenyl)-2,2-dimethylcyclopropanecarboxylate <br />CAS#: 82657-04-3<br />Empirical Formmula: C23H22ClF3O2 <br />Application: Contact and stomach action.  Uses Effective against a broad range of foliar pests, including Coleoptera, Diptera,Heteroptera, Homoptera, Lepidoptera and Orthoptera; it also controls some species of Acarina. Crops include cereals, citrus, cotton, fruit, grapes, ornamentals and vegetables. Rates range from 5 g/ha against Aphididae in cereals to 45 g/ha against Aphididae and Lepidoptera in top fruit. <br />Formulation types: TC/FS/EC<Br />Package: 100ml/bottle,250ml/bottle,500ml/bottle,1L/bottle,20L/drum,200L/drum,100g/bag,250g/bag,500g/bag,1KG/bag,25KG/drum,etc.",
  "产品详情": "production detail",
  "二维码描述": "Please email us for more product information, catalogues and quotations",
  "微信扫码": "Please scan the following QR code by WeChat to get the product catalogue",
  "没有了": "No more",
  "技术支持": "Technical support"
}